In [4]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import os
os.chdir("C:/Users/mateo/Documents/repos/Viz_2022_Grupo_4/")

In [5]:
path = "docker\challenge_data"

#data challange
employers = pd.read_csv(path+"\Attributes\Employers.csv")
jobs = pd.read_csv(path+"\Attributes\Jobs.csv")
buildings = pd.read_csv(path+"\Attributes\Buildings.csv")

schools = pd.read_csv(path+"\Attributes\Schools.csv")
pubs = pd.read_csv(path+"\Attributes\Pubs.csv")
restos =pd.read_csv(path+"\Attributes\Restaurants.csv")

financial = pd.read_csv(path+"\Journals\FinancialJournal.csv")
checkin = pd.read_csv(path+"\Journals\CheckinJournal.csv")

# mati tabs
jobs = pd.read_csv("docker/Files/participant_job.csv",
                    delimiter = ";", header=1)
hrs_spent = pd.read_csv("docker/Files/hours_spent_in_venue.csv",
                    delimiter = ";", header=1)
employ = pd.read_csv("docker/Files/employer_employee.csv",
                    delimiter = ";", header=1)

In [6]:
restos.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   restaurantId   20 non-null     int64
 1   foodCost       20 non-null     float64
 2   maxOccupancy   20 non-null     int64
 3   location       20 non-null     object
 4   buildingId     20 non-null     int64
dtypes: float64(1), int64(3), object(1)
memory usage: 928.0+ bytes

In [14]:
hrs_spent.head()

   participantid from_timestamp to_timestamps  hour_diff  venueid  venuetype
0            619         3/1/22        3/1/22        2.0     1798        Pub
1            619         3/1/22        3/1/22        0.0     1414  Apartment
2            619         3/1/22        3/1/22        2.0     1800        Pub
3            619         3/1/22        3/1/22        1.0     1414  Apartment
4            619         3/1/22        3/1/22        3.0     1344        Pub

## Reviso si venuiId coincide con Id de restaurante, pub y school

In [35]:
pd.unique(checkin.venueType)

array(['Pub', 'Restaurant', 'Apartment', 'Workplace'], dtype=object)

In [31]:
set_checks = set(pd.unique(checkin.venueId) )

set_restos = set(pd.unique(restos.restaurantId) )
set_pubs = set(pd.unique(pubs.pubId) )
set_schools = set(pd.unique(schools.schoolId) )


print(len(set_checks) )

1114

In [43]:
cum_largo_sets = 0
cum_largo_inter = 0

for i in [set_restos, set_pubs, set_schools]:
    largo_sets = len(i)
    cum_largo_sets+= largo_sets
    
    largo_inter = len(set_checks.intersection(i ) )
    cum_largo_inter += largo_inter
    print(largo_inter)

print()
print(cum_largo_sets)
print(cum_largo_inter)

20
12
1

36
33

## Concat costs

In [9]:
employers

     employerId                                       location  buildingId
0           379  POINT (-1849.997168394888 1744.6010147106394)         823
1           380    POINT (41.51783767879146 418.7264799744545)         154
2           381   POINT (877.2786575380362 1358.5441805909259)         279
3           382   POINT (670.3987400004884 1584.4743462106067)           3
4           383   POINT (829.9556783260775 2163.4803049897623)         146
..          ...                                            ...         ...
248        1793  POINT (-3313.211912858075 6185.8337275541235)         738
249        1794   POINT (-3786.373075235378 4999.485452069126)         802
250        1795    POINT (-3267.606054814424 6452.56705940432)         953
251        1796   POINT (-3725.261225376805 6345.551342169127)        1011
252        1797   POINT (-3759.480918044369 5179.602735764589)         949

[253 rows x 3 columns]

In [15]:
pubs.info()
pd.unique(pubs.pubId)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   pubId         12 non-null     int64
 1   hourlyCost    12 non-null     float64
 2   maxOccupancy  12 non-null     int64
 3   location      12 non-null     object
 4   buildingId    12 non-null     int64
dtypes: float64(1), int64(3), object(1)
memory usage: 608.0+ bytes

array([ 442,  443,  444,  892,  893,  894, 1342, 1343, 1344, 1798, 1799,
       1800], dtype=int64)

In [13]:
schools.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   schoolId       4 non-null      int64
 1   monthlyCost    4 non-null      float64
 2   maxEnrollment  4 non-null      int64
 3   location       4 non-null      object
 4   buildingId     4 non-null      int64
dtypes: float64(1), int64(3), object(1)
memory usage: 288.0+ bytes

In [12]:
restos.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   restaurantId   20 non-null     int64
 1   foodCost       20 non-null     float64
 2   maxOccupancy   20 non-null     int64
 3   location       20 non-null     object
 4   buildingId     20 non-null     int64
dtypes: float64(1), int64(3), object(1)
memory usage: 928.0+ bytes

## Join

In [ ]:
spents_df = pd.merge( hrs_spent , pubs[["pubId", "hourlyCost", "buildingId"]],
        how = "inner" , left_on = "venueid" ,  right_on = "pubId")
spents_df["spents"] = spents_df.hourlyCost * spents_df.hour_diff
spents_df

,participantid,from_timestamp,to_timestamps,hour_diff,venueid,venuetype,pubId,hourlyCost,buildingId,spents
0,619,3/1/22,3/1/22,2.0,1798,Pub,1798,11.545351,953,23.090702
1,619,3/2/22,3/2/22,1.0,1798,Pub,1798,11.545351,953,11.545351
2,619,3/4/22,3/5/22,1.0,1798,Pub,1798,11.545351,953,11.545351
3,619,3/6/22,3/6/22,2.0,1798,Pub,1798,11.545351,953,23.090702
4,619,3/6/22,3/6/22,3.0,1798,Pub,1798,11.545351,953,34.636054
...,...,...,...,...,...,...,...,...,...,...
294,619,2/13/23,2/14/23,3.0,1342,Pub,1342,14.140037,429,42.420110
295,619,2/14/23,2/14/23,3.0,1342,Pub,1342,14.140037,429,42.420110
296,619,3/31/23,4/1/23,0.0,1342,Pub,1342,14.140037,429,0.000000
297,619,4/1/23,4/1/23,1.0,1342,Pub,1342,14.140037,429,14.140037
298,619,4/19/23,4/19/23,1.0,1342,Pub,1342,14.140037,429,14.140037

In [17]:
pd.unique(spents_df.pubId)

array([1798, 1800, 1344, 1799, 1342], dtype=int64)